#pragma once

#include <iosfwd>
#include <memory>
#include <stdexcept>
#include <string>
#include <string_view>
#include <variant>
#include <vector>

// РџРѕР·РёС†РёСЏ СЏС‡РµР№РєРё. Р�РЅРґРµРєСЃР°С†РёСЏ СЃ РЅСѓР»СЏ.
struct Position {
    int row = 0;
    int col = 0;

    bool operator==(Position rhs) const;
    bool operator<(Position rhs) const;

    bool IsValid() const;
    std::string ToString() const;

    static Position FromString(std::string_view str);

    static const int MAX_ROWS = 16384;
    static const int MAX_COLS = 16384;
    static const Position NONE;
};

struct Size {
    int rows = 0;
    int cols = 0;

    bool operator==(Size rhs) const;
};

// РћРїРёСЃС‹РІР°РµС‚ РѕС€РёР±РєРё, РєРѕС‚РѕСЂС‹Рµ РјРѕРіСѓС‚ РІРѕР·РЅРёРєРЅСѓС‚СЊ РїСЂРё РІС‹С‡РёСЃР»РµРЅРёРё С„РѕСЂРјСѓР»С‹.
class FormulaError {
public:
    enum class Category {
        Ref,    // СЃСЃС‹Р»РєР° РЅР° СЏС‡РµР№РєСѓ СЃ РЅРµРєРѕСЂСЂРµРєС‚РЅРѕР№ РїРѕР·РёС†РёРµР№
        Value,  // СЏС‡РµР№РєР° РЅРµ РјРѕР¶РµС‚ Р±С‹С‚СЊ С‚СЂР°РєС‚РѕРІР°РЅР° РєР°Рє С‡РёСЃР»Рѕ
        Arithmetic,  // РІ СЂРµР·СѓР»СЊС‚Р°С‚Рµ РІС‹С‡РёСЃР»РµРЅРёСЏ РІРѕР·РЅРёРєР»Рѕ РґРµР»РµРЅРёРµ РЅР° РЅРѕР»СЊ
    };

    FormulaError(Category category);

    Category GetCategory() const;

    bool operator==(FormulaError rhs) const;

    std::string_view ToString() const;

private:
    Category category_;
};
struct PositionHash {
    /*std::hash<std::string> hasher;

    size_t operator()(const Position& pos) const {
        return hasher(pos.ToString());
    }
    */
    std::hash<int> hasher;

    size_t operator()(const Position& pos) const {
        //return hasher(pos.col * Position::MAX_ROWS + pos.row);
        return hasher(pos.row * Position::MAX_COLS + pos.col);
    }
};

std::ostream& operator<<(std::ostream& output, FormulaError fe);

// Р�СЃРєР»СЋС‡РµРЅРёРµ, РІС‹Р±СЂР°СЃС‹РІР°РµРјРѕРµ РїСЂРё РїРѕРїС‹С‚РєРµ РїРµСЂРµРґР°С‚СЊ РІ РјРµС‚РѕРґ РЅРµРєРѕСЂСЂРµРєС‚РЅСѓСЋ РїРѕР·РёС†РёСЋ
class InvalidPositionException : public std::out_of_range {
public:
    using std::out_of_range::out_of_range;
};

// Р�СЃРєР»СЋС‡РµРЅРёРµ, РІС‹Р±СЂР°СЃС‹РІР°РµРјРѕРµ РїСЂРё РїРѕРїС‹С‚РєРµ Р·Р°РґР°С‚СЊ СЃРёРЅС‚Р°РєСЃРёС‡РµСЃРєРё РЅРµРєРѕСЂСЂРµРєС‚РЅСѓСЋ
// С„РѕСЂРјСѓР»Сѓ
class FormulaException : public std::runtime_error {
public:
    using std::runtime_error::runtime_error;
};

// Р�СЃРєР»СЋС‡РµРЅРёРµ, РІС‹Р±СЂР°СЃС‹РІР°РµРјРѕРµ РїСЂРё РїРѕРїС‹С‚РєРµ Р·Р°РґР°С‚СЊ С„РѕСЂРјСѓР»Сѓ, РєРѕС‚РѕСЂР°СЏ РїСЂРёРІРѕРґРёС‚ Рє
// С†РёРєР»РёС‡РµСЃРєРѕР№ Р·Р°РІРёСЃРёРјРѕСЃС‚Рё РјРµР¶РґСѓ СЏС‡РµР№РєР°РјРё
class CircularDependencyException : public std::runtime_error {
public:
    using std::runtime_error::runtime_error;
};

class CellInterface {
public:
    // Р›РёР±Рѕ С‚РµРєСЃС‚ СЏС‡РµР№РєРё, Р»РёР±Рѕ Р·РЅР°С‡РµРЅРёРµ С„РѕСЂРјСѓР»С‹, Р»РёР±Рѕ СЃРѕРѕР±С‰РµРЅРёРµ РѕР± РѕС€РёР±РєРµ РёР·
    // С„РѕСЂРјСѓР»С‹
    using Value = std::variant<std::string, double, FormulaError>;

    virtual ~CellInterface() = default;

    // Р’РѕР·РІСЂР°С‰Р°РµС‚ РІРёРґРёРјРѕРµ Р·РЅР°С‡РµРЅРёРµ СЏС‡РµР№РєРё.
    // Р’ СЃР»СѓС‡Р°Рµ С‚РµРєСЃС‚РѕРІРѕР№ СЏС‡РµР№РєРё СЌС‚Рѕ РµС‘ С‚РµРєСЃС‚ (Р±РµР· СЌРєСЂР°РЅРёСЂСѓСЋС‰РёС… СЃРёРјРІРѕР»РѕРІ). Р’
    // СЃР»СѓС‡Р°Рµ С„РѕСЂРјСѓР»С‹ - С‡РёСЃР»РѕРІРѕРµ Р·РЅР°С‡РµРЅРёРµ С„РѕСЂРјСѓР»С‹ РёР»Рё СЃРѕРѕР±С‰РµРЅРёРµ РѕР± РѕС€РёР±РєРµ.
    virtual Value GetValue() const = 0;
    // Р’РѕР·РІСЂР°С‰Р°РµС‚ РІРЅСѓС‚СЂРµРЅРЅРёР№ С‚РµРєСЃС‚ СЏС‡РµР№РєРё, РєР°Рє РµСЃР»Рё Р±С‹ РјС‹ РЅР°С‡Р°Р»Рё РµС‘
    // СЂРµРґР°РєС‚РёСЂРѕРІР°РЅРёРµ. Р’ СЃР»СѓС‡Р°Рµ С‚РµРєСЃС‚РѕРІРѕР№ СЏС‡РµР№РєРё СЌС‚Рѕ РµС‘ С‚РµРєСЃС‚ (РІРѕР·РјРѕР¶РЅРѕ,
    // СЃРѕРґРµСЂР¶Р°С‰РёР№ СЌРєСЂР°РЅРёСЂСѓСЋС‰РёРµ СЃРёРјРІРѕР»С‹). Р’ СЃР»СѓС‡Р°Рµ С„РѕСЂРјСѓР»С‹ - РµС‘ РІС‹СЂР°Р¶РµРЅРёРµ.
    virtual std::string GetText() const = 0;

    // Р’РѕР·РІСЂР°С‰Р°РµС‚ СЃРїРёСЃРѕРє СЏС‡РµРµРє, РєРѕС‚РѕСЂС‹Рµ РЅРµРїРѕСЃСЂРµРґСЃС‚РІРµРЅРЅРѕ Р·Р°РґРµР№СЃС‚РІРѕРІР°РЅС‹ РІ РґР°РЅРЅРѕР№
    // С„РѕСЂРјСѓР»Рµ. РЎРїРёСЃРѕРє РѕС‚СЃРѕСЂС‚РёСЂРѕРІР°РЅ РїРѕ РІРѕР·СЂР°СЃС‚Р°РЅРёСЋ Рё РЅРµ СЃРѕРґРµСЂР¶РёС‚ РїРѕРІС‚РѕСЂСЏСЋС‰РёС…СЃСЏ
    // СЏС‡РµРµРє. Р’ СЃР»СѓС‡Р°Рµ С‚РµРєСЃС‚РѕРІРѕР№ СЏС‡РµР№РєРё СЃРїРёСЃРѕРє РїСѓСЃС‚.
    virtual std::vector<Position> GetReferencedCells() const = 0;
};

inline constexpr char FORMULA_SIGN = '=';
inline constexpr char ESCAPE_SIGN = '\'';

// Р�РЅС‚РµСЂС„РµР№СЃ С‚Р°Р±Р»РёС†С‹
class SheetInterface {
public:
    virtual ~SheetInterface() = default;

    // Р—Р°РґР°С‘С‚ СЃРѕРґРµСЂР¶РёРјРѕРµ СЏС‡РµР№РєРё. Р•СЃР»Рё С‚РµРєСЃС‚ РЅР°С‡РёРЅР°РµС‚СЃСЏ СЃРѕ Р·РЅР°РєР° "=", С‚Рѕ РѕРЅ
    // РёРЅС‚РµСЂРїСЂРµС‚РёСЂСѓРµС‚СЃСЏ РєР°Рє С„РѕСЂРјСѓР»Р°. Р•СЃР»Рё Р·Р°РґР°С‘С‚СЃСЏ СЃРёРЅС‚Р°РєСЃРёС‡РµСЃРєРё РЅРµРєРѕСЂСЂРµРєС‚РЅР°СЏ
    // С„РѕСЂРјСѓР»Р°, С‚Рѕ Р±СЂРѕСЃР°РµС‚СЃСЏ РёСЃРєР»СЋС‡РµРЅРёРµ FormulaException Рё Р·РЅР°С‡РµРЅРёРµ СЏС‡РµР№РєРё РЅРµ
    // РёР·РјРµРЅСЏРµС‚СЃСЏ. Р•СЃР»Рё Р·Р°РґР°С‘С‚СЃСЏ С„РѕСЂРјСѓР»Р°, РєРѕС‚РѕСЂР°СЏ РїСЂРёРІРѕРґРёС‚ Рє С†РёРєР»РёС‡РµСЃРєРѕР№
    // Р·Р°РІРёСЃРёРјРѕСЃС‚Рё (РІ С‡Р°СЃС‚РЅРѕСЃС‚Рё, РµСЃР»Рё С„РѕСЂРјСѓР»Р° РёСЃРїРѕР»СЊР·СѓРµС‚ С‚РµРєСѓС‰СѓСЋ СЏС‡РµР№РєСѓ), С‚Рѕ
    // Р±СЂРѕСЃР°РµС‚СЃСЏ РёСЃРєР»СЋС‡РµРЅРёРµ CircularDependencyException Рё Р·РЅР°С‡РµРЅРёРµ СЏС‡РµР№РєРё РЅРµ
    // РёР·РјРµРЅСЏРµС‚СЃСЏ.
    // РЈС‚РѕС‡РЅРµРЅРёСЏ РїРѕ Р·Р°РїРёСЃРё С„РѕСЂРјСѓР»С‹:
    // * Р•СЃР»Рё С‚РµРєСЃС‚ СЃРѕРґРµСЂР¶РёС‚ С‚РѕР»СЊРєРѕ СЃРёРјРІРѕР» "=" Рё Р±РѕР»СЊС€Рµ РЅРёС‡РµРіРѕ, С‚Рѕ РѕРЅ РЅРµ СЃС‡РёС‚Р°РµС‚СЃСЏ
    // С„РѕСЂРјСѓР»РѕР№
    // * Р•СЃР»Рё С‚РµРєСЃС‚ РЅР°С‡РёРЅР°РµС‚СЃСЏ СЃ СЃРёРјРІРѕР»Р° "'" (Р°РїРѕСЃС‚СЂРѕС„), С‚Рѕ РїСЂРё РІС‹РІРѕРґРµ Р·РЅР°С‡РµРЅРёСЏ
    // СЏС‡РµР№РєРё РјРµС‚РѕРґРѕРј GetValue() РѕРЅ РѕРїСѓСЃРєР°РµС‚СЃСЏ. РњРѕР¶РЅРѕ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ, РµСЃР»Рё РЅСѓР¶РЅРѕ
    // РЅР°С‡Р°С‚СЊ С‚РµРєСЃС‚ СЃРѕ Р·РЅР°РєР° "=", РЅРѕ С‡С‚РѕР±С‹ РѕРЅ РЅРµ РёРЅС‚РµСЂРїСЂРµС‚РёСЂРѕРІР°Р»СЃСЏ РєР°Рє С„РѕСЂРјСѓР»Р°.
    virtual void SetCell(Position pos, std::string text) = 0;

    // Р’РѕР·РІСЂР°С‰Р°РµС‚ Р·РЅР°С‡РµРЅРёРµ СЏС‡РµР№РєРё.
    // Р•СЃР»Рё СЏС‡РµР№РєР° РїСѓСЃС‚Р°, РјРѕР¶РµС‚ РІРµСЂРЅСѓС‚СЊ nullptr.
    virtual const CellInterface* GetCell(Position pos) const = 0;
    virtual CellInterface* GetCell(Position pos) = 0;

    // РћС‡РёС‰Р°РµС‚ СЏС‡РµР№РєСѓ.
    // РџРѕСЃР»РµРґСѓСЋС‰РёР№ РІС‹Р·РѕРІ GetCell() РґР»СЏ СЌС‚РѕР№ СЏС‡РµР№РєРё РІРµСЂРЅС‘С‚ Р»РёР±Рѕ nullptr, Р»РёР±Рѕ
    // РѕР±СЉРµРєС‚ СЃ РїСѓСЃС‚С‹Рј С‚РµРєСЃС‚РѕРј.
    virtual void ClearCell(Position pos) = 0;

    // Р’С‹С‡РёСЃР»СЏРµС‚ СЂР°Р·РјРµСЂ РѕР±Р»Р°СЃС‚Рё, РєРѕС‚РѕСЂР°СЏ СѓС‡Р°СЃС‚РІСѓРµС‚ РІ РїРµС‡Р°С‚Рё.
    // РћРїСЂРµРґРµР»СЏРµС‚СЃСЏ РєР°Рє РѕРіСЂР°РЅРёС‡РёРІР°СЋС‰РёР№ РїСЂСЏРјРѕСѓРіРѕР»СЊРЅРёРє РІСЃРµС… СЏС‡РµРµРє СЃ РЅРµРїСѓСЃС‚С‹Рј
    // С‚РµРєСЃС‚РѕРј.
    virtual Size GetPrintableSize() const = 0;
   
    // Р’С‹РІРѕРґРёС‚ РІСЃСЋ С‚Р°Р±Р»РёС†Сѓ РІ РїРµСЂРµРґР°РЅРЅС‹Р№ РїРѕС‚РѕРє. РЎС‚РѕР»Р±С†С‹ СЂР°Р·РґРµР»СЏСЋС‚СЃСЏ Р·РЅР°РєРѕРј
    // С‚Р°Р±СѓР»СЏС†РёРё. РџРѕСЃР»Рµ РєР°Р¶РґРѕР№ СЃС‚СЂРѕРєРё РІС‹РІРѕРґРёС‚СЃСЏ СЃРёРјРІРѕР» РїРµСЂРµРІРѕРґР° СЃС‚СЂРѕРєРё. Р”Р»СЏ
    // РїСЂРµРѕР±СЂР°Р·РѕРІР°РЅРёСЏ СЏС‡РµРµРє РІ СЃС‚СЂРѕРєСѓ РёСЃРїРѕР»СЊР·СѓСЋС‚СЃСЏ РјРµС‚РѕРґС‹ GetValue() РёР»Рё GetText()
    // СЃРѕРѕС‚РІРµС‚СЃС‚РІРµРЅРЅРѕ. РџСѓСЃС‚Р°СЏ СЏС‡РµР№РєР° РїСЂРµРґСЃС‚Р°РІР»СЏРµС‚СЃСЏ РїСѓСЃС‚РѕР№ СЃС‚СЂРѕРєРѕР№ РІ Р»СЋР±РѕРј СЃР»СѓС‡Р°Рµ.
    virtual void PrintValues(std::ostream& output) const = 0;
    virtual void PrintTexts(std::ostream& output) const = 0;
};

// РЎРѕР·РґР°С‘С‚ РіРѕС‚РѕРІСѓСЋ Рє СЂР°Р±РѕС‚Рµ РїСѓСЃС‚СѓСЋ С‚Р°Р±Р»РёС†Сѓ.
std::unique_ptr<SheetInterface> CreateSheet();
